[
    {
        "jobTitle": "Fullstack Engineer",
        "company": "ETAS GmbH (former Bosch SoftTec)",
        "location": "Hildesheim, Germany",
        "time": "Jan 2023 – Present",
        "tasks": [
            {
                "summary": "Core OSS contributor to Eclipse Velocitas™ within the Eclipse Foundation; developed a toolchain focused on empowering automotive application developers with scalable, container-based solutions and supporting open-source innovation standardization.",
                "technologies": [
                    "Python",
                    "C++",
                    "Docker",
                    "Kubernetes",
                    "DevContainers",
                    "VSCode",
                    "GitHub Actions"
                ]
            },
            {
                "summary": "Developed a CLI package manager for the Eclipse Velocitas™ toolchain, implementing lifecycle management for the development environment of vehicle applications, allowing developers to focus on business logic while the CLI handles environment setup, runtime and maintenance.",
                "technologies": [
                    "TypeScript",
                    "GitHub Actions"
                ]
            },
            {
                "summary": "Designed and developed the ETAS Vehicle App Generator, an end-to-end solution leveraging generative AI to transform natural language prompts into vehicle applications. The system handles application generation, building, provisioning and real-time deployment on ETAS EDGE Middleware devices.",
                "technologies": [
                    "TypeScript",
                    "React",
                    "Python",
                    "Docker"
                ]
            },
            {
                "summary": "Created a performance testing tool for the Eclipse Kuksa™ Databroker, a gRPC service written in Rust that acts as a broker for vehicle data, optimizing throughput and data handling.",
                "technologies": [
                    "Rust"
                ]
            },
            {
                "summary": "Designed and developed a VSCode extension for ETAS EDGE Middleware, enabling CAN Bus to VSS signal mapping, gRPC service definitions, client API creation, and middleware debugging. Mentored the team to streamline workflows and ensure successful implementation.",
                "technologies": [
                    "TypeScript",
                    "Svelte"
                ]
            }
        ]
    },
    {
        "jobTitle": "Cloud Software Developer",
        "company": "Bosch SoftTec GmbH",
        "location": "Hildesheim, Germany",
        "time": "April 2019 – Jan 2023",
        "tasks": [
            {
                "summary": "Developed a personal voice-assistant system, including a recipe inspiration system with a machine learning recommendation engine, improving recipe discovery for users and enhancing user interaction through voice commands.",
                "technologies": [
                    "TypeScript",
                    "Vue",
                    "AWS",
                    "Bitbucket"
                ]
            },
            {
                "summary": "Created a backend for hazard spot warnings using map, navigation, and GPS data, enhancing safety alerts for users.",
                "technologies": [
                    "TypeScript",
                    "Go",
                    "Terraform",
                    "Kubernetes",
                    "Azure DevOps"
                ]
            },
            {
                "summary": "Developed a vehicle and fleet management platform for managing vehicle lifecycles and control unit devices, optimizing fleet operations.",
                "technologies": [
                    "TypeScript",
                    "Go",
                    "Python",
                    "Jenkins",
                    "GitHub Actions",
                    "Kubernetes",
                    "Azure"
                ]
            }
        ]
    },
    {
        "jobTitle": "Junior DevOps Engineer",
        "company": "E.ON Business Services GmbH",
        "location": "Hannover, Germany",
        "time": "Aug 2016 – April 2019",
        "tasks": [
            {
                "summary": "Developed a cloud-based development platform, improving efficiency, automation, and availability for application development.",
                "technologies": [
                    "Go",
                    "Azure",
                    "Chef",
                    "Jenkins",
                    "Docker"
                ]
            },
            {
                "summary": "Built a user management and provisioning UI for the cloud platform, enabling self-service for users and cloud resource management.",
                "technologies": [
                    "TypeScript",
                    "React",
                    "Redux",
                    "Jenkins"
                ]
            },
            {
                "summary": "Designed and maintained cloud-based production infrastructure and CI/CD pipelines for a predictive maintenance solution, ensuring stability and efficient deployment.",
                "technologies": [
                    "Go",
                    "Angular",
                    "Kubernetes",
                    "GitLab CI"
                ]
            }
        ]
    },
    {
        "jobTitle": "Dual Studies",
        "company": "E.ON Business Services GmbH",
        "location": "Hannover, Germany",
        "time": "Aug 2013 – Aug 2016",
        "tasks": [
            {
                "summary": "Completed a dual study program combining theoretical education in Software Engineering with practical experience in software development, DevOps and agile methodologies.",
                "technologies": []
            },
            {
                "summary": "Gained hands-on expertise in Java, architectural patterns, and DevOps practices, applying them across various projects at E.ON.",
                "technologies": [
                    "Java",
                    "Spring"
                ]
            }
        ]
    },
    {
        "jobTitle": "Education",
        "company": "Hochschule Weserbergland",
        "location": "Hameln, Germany",
        "time": "Aug 2013 – Aug 2016",
        "tasks": [
            {
                "summary": "Bachelor of Science in Business Informatics: Application Development.",
                "technologies": []
            }
        ]
    }
]
